/*
                                  Реализация игры Блэкджек. Создание следующих классов:
		1.1) Игрок (Player) - абстрактный класс
   поле: имя игрока
        1.2) Игрок (Player) - дочерний от абстрактного
   поля: запрос на выдачу дополнительных карт; дочерний класс 3) Рука (Hand)
        2) Дилер "Крупье" (Dealer) - дочерний от абстрактного
   поля: выдача карт (игроку или дилеру); дочерний класс 3) Рука (Hand) и 4) Башмак, шуз (Shoe)
        3) Рука (Hand)
   поля: количество карт у каждого игрока, сумма очков у каждого игрока, сумма фишек
        4) Башмак, шуз (Shoe)
   поля: общее количество карт, колода(ы) карт, перемешивание карт, карта на выдачу
        5) Игра (Game)
   поля: количество игроков, текущий игрок, победитель, банк; дочерний класс 4) Башмак, шуз (Shoe)
*/